zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
    err = i2s_driver_install(SPEAK_I2S_NUMBER, &i2s_config, 0, NULL);
    if (err != ESP_OK) {
        Serial.printf("i2s_driver_install error: %d\n", err);
        return false;
    }
    g_i2sInstalled = true;

    i2s_pin_config_t tx_pin_config;
#if (ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 3, 0))
    tx_pin_config.mck_io_num = I2S_PIN_NO_CHANGE;
#endif
    tx_pin_config.bck_io_num   = CONFIG_I2S_BCK_PIN;
    tx_pin_config.ws_io_num    = CONFIG_I2S_LRCK_PIN;
    tx_pin_config.data_out_num = CONFIG_I2S_DATA_PIN;
    tx_pin_config.data_in_num  = CONFIG_I2S_DATA_IN_PIN;

    err = i2s_set_pin(SPEAK_I2S_NUMBER, &tx_pin_config);
    if (err != ESP_OK) {
        Serial.printf("i2s_set_pin error: %d\n", err);
        return false;
    }

    int sampleRate = (mode == MODE_MIC) ? 16000 : g_speakerSampleRate;
    err = i2s_set_clk(SPEAK_I2S_NUMBER, sampleRate, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_MONO);
    if (err != ESP_OK) {
        Serial.printf("i2s_set_clk error: %d\n", err);
        return false;
    }

    if (mode == MODE_MIC) {
        i2s_zero_dma_buffer(SPEAK_I2S_NUMBER);
    }

    g_currentI2SMode = mode;
    return true;
}

void setState(DeviceState next) {
    g_state = next;
    switch (next) {
        case STATE_IDLE:
            M5.dis.drawpix(0, CRGB(0, 0, 64));
            break;
        case STATE_READY:
            M5.dis.drawpix(0, CRGB(0, 255, 0));
            break;
        case STATE_RECORDING:
            M5.dis.drawpix(0, CRGB(255, 255, 0));
            break;
        case STATE_WAIT_RESULT:
            M5.dis.drawpix(0, CRGB(0, 128, 255));
            break;
        case STATE_PLAYBACK:
            M5.dis.drawpix(0, CRGB(255, 0, 255));
            break;
        default:
            M5.dis.drawpix(0, CRGB(255, 0, 0));
            break;
    }
}

bool ensureI2SMode(int mode) {
    if (g_currentI2SMode == mode) {
        return true;
    }
    return InitI2SSpeakOrMic(mode);
}

bool connectWifi() {
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.begin(WifiSSID, WifiPWD);

    Serial.println("Connecting to WiFi...");
    setState(STATE_IDLE);

    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print('.');
        if (millis() - start > 20000) {
            Serial.println("\nWiFi Connection Failed");
            setState(STATE_ERROR);
            return false;
        }
    }

    Serial.println("\nWiFi connected");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    return true;
}


void onWebsocketMessage(websockets::WebsocketsMessage message);
void onWebsocketEvent(websockets::WebsocketsEvent event, String data);
void resetMicCaptureStats();
void printMicCaptureStats(const char *tag);
void maybePrintMicCaptureStats();
void applyMicFadeOutTail(uint8_t *data, size_t len);
void markWsActivity();
bool isWsConnectionRequired(bool buttonPressed);
void closeDeviceWebSocketIfOpen(const char *reason);

void markWsActivity() {
    g_lastWsActivityAtMs = millis();
}

bool isWsConnectionRequired(bool buttonPressed) {
    if (buttonPressed && g_state == STATE_READY) {
        return true;
    }
    return g_state == STATE_RECORDING ||
           g_state == STATE_WAIT_RESULT ||
           g_state == STATE_PLAYBACK ||
           g_ttsActive;
}

void closeDeviceWebSocketIfOpen(const char *reason) {
    if (g_wsIntentionalClose) {
        return;
    }
    if (!isWebSocketConnected && !ws_client.available()) {
        return;
    }
    g_wsIntentionalClose = true;
    Serial.printf("[ws] close idle connection: %s\n", reason);
    ws_client.close();
    isWebSocketConnected = false;
}

bool connectDeviceWebSocket() {
    g_lastWsConnectAttemptAtMs = millis();
    ws_client.onMessage(onWebsocketMessage);
    ws_client.onEvent(onWebsocketEvent);

    Serial.printf("Connect ws://%s:%d%s\n", BFF_SERVER_HOST, BFF_SERVER_PORT, DEVICE_WS_PATH);

    bool ok = ws_client.connect(BFF_SERVER_HOST, BFF_SERVER_PORT, DEVICE_WS_PATH);
    if (!ok) {
        isWebSocketConnected = false;
        Serial.println("[ws] connect failed");
        return false;
    }

    isWebSocketConnected = true;
    g_wsIntentionalClose = false;
    markWsActivity();
    return true;
}

void startVoiceSession() {
    if (!isWebSocketConnected || !ws_client.available()) {
        Serial.println("ws not connected");
        setState(STATE_ERROR);
        return;
    }

    if (!ensureI2SMode(MODE_MIC)) {
        setState(STATE_ERROR);
        return;
    }

    resetMicCaptureStats();
    Serial.printf("[mic] gain=%.2f gate=%d soft_limit=%d\n", MIC_CAPTURE_GAIN, MIC_NOISE_GATE, MIC_SOFT_LIMIT);
    Serial.println("voice session started");
    setState(STATE_RECORDING);
}

void finishVoiceSession() {
    if (!isWebSocketConnected || !ws_client.available()) {
        return;
    }

    ws_client.send("finish");
    markWsActivity();

    Serial.println("session finish sent");
    printMicCaptureStats("session");
    setState(STATE_WAIT_RESULT);
}

void writeSpeakerPcm(const uint8_t *data, size_t len) {
    if (!ensureI2SMode(MODE_SPK)) {
        setState(STATE_ERROR);
        return;
    }

    // Apply software volume attenuation for 4Ω speaker to prevent distortion at high gain.
    // SPEAKER_VOLUME 255 = unity (no change); lower values reduce output level.

    size_t bytesPerSample = 2;
    size_t samples = len / bytesPerSample;
    uint8_t outBuf[2048];

    int16_t maxS = 0;
    int32_t sumS = 0;
    for (size_t i = 0; i < samples; ++i) {
        int16_t s = (int16_t)((uint16_t)data[i * 2] | ((uint16_t)data[i * 2 + 1] << 8));
        s = (int16_t)((int32_t)s * SPEAKER_VOLUME / 255);
        outBuf[i * 2]     = (uint8_t)(s & 0xFF);
        outBuf[i * 2 + 1] = (uint8_t)((s >> 8) & 0xFF);
        int16_t absS = s >= 0 ? s : -s;
        if (absS > maxS) maxS = absS;
        sumS += absS;
    }

    // Print volume stats every 2 seconds to avoid flooding serial
    static unsigned long lastVolPrintAtMs = 0;
    unsigned long now = millis();
    if (now - lastVolPrintAtMs >= 2000) {
        float avg = (float)sumS / (float)samples;
        float dbAtten = 20.0f * log10((float)SPEAKER_VOLUME / 255.0f);
        Serial.printf("[out] vol=%u max_out=%d avg_out=%.1f atten=%.1fdB\n",
                      SPEAKER_VOLUME, maxS, avg, dbAtten);
        lastVolPrintAtMs = now;
    }

    size_t written = 0;
    esp_err_t err = i2s_write(
        SPEAK_I2S_NUMBER,
        outBuf,
        len,
        &written,
        120 / portTICK_PERIOD_MS
    );
    if (err != ESP_OK) {
        Serial.printf("i2s_write error: %d\n", err);
        setState(STATE_ERROR);
    }
}

static inline int16_t clampS16(int32_t v) {
    if (v > 32767) return 32767;
    if (v < -32768) return -32768;
    return (int16_t)v;
}

